benchmark-50.log
====== SET ======
  100000 requests completed in 3.88 seconds
  50 parallel clients
  50 bytes payload
  keep alive: 1

56.53% <= 1 milliseconds
87.58% <= 2 milliseconds
93.69% <= 3 milliseconds
95.88% <= 4 milliseconds
97.44% <= 5 milliseconds
98.18% <= 6 milliseconds
98.67% <= 7 milliseconds
98.98% <= 8 milliseconds
99.10% <= 9 milliseconds
99.22% <= 10 milliseconds
99.48% <= 11 milliseconds
99.53% <= 12 milliseconds
99.66% <= 13 milliseconds
99.75% <= 14 milliseconds
99.84% <= 15 milliseconds
99.88% <= 16 milliseconds
99.92% <= 17 milliseconds
99.94% <= 18 milliseconds
99.96% <= 20 milliseconds
99.96% <= 21 milliseconds
99.97% <= 22 milliseconds
99.99% <= 23 milliseconds
100.00% <= 27 milliseconds
100.00% <= 27 milliseconds
25799.79 requests per second

====== GET ======
  100000 requests completed in 3.59 seconds
  50 parallel clients
  50 bytes payload
  keep alive: 1

65.05% <= 1 milliseconds
90.95% <= 2 milliseconds
95.58% <= 3 milliseconds
97.14% <= 4 milliseconds
98.00% <= 5 milliseconds
98.57% <= 6 milliseconds
98.89% <= 7 milliseconds
99.16% <= 8 milliseconds
99.27% <= 9 milliseconds
99.40% <= 10 milliseconds
99.47% <= 11 milliseconds
99.53% <= 12 milliseconds
99.66% <= 13 milliseconds
99.69% <= 14 milliseconds
99.81% <= 15 milliseconds
99.83% <= 18 milliseconds
99.83% <= 19 milliseconds
99.84% <= 20 milliseconds
99.86% <= 23 milliseconds
99.87% <= 24 milliseconds
99.87% <= 25 milliseconds
99.90% <= 26 milliseconds
99.93% <= 27 milliseconds
99.96% <= 28 milliseconds
99.98% <= 31 milliseconds
100.00% <= 31 milliseconds
27886.22 requests per second